IDENTIFICATION DIVISION.
       PROGRAM-ID. TIPOS-PRIMITIVOS.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01 WS-NUMERICO       PIC 9(5)   VALUE 12345.
       01 WS-DECIMAL        PIC 9(3)V99 VALUE 123.45.
       01 WS-NUMERICO-SINAL PIC S9(4)  VALUE -100.
       01 WS-ALFABETICO     PIC A(10)  VALUE "COBOL".
       01 WS-ALFANUMERICO   PIC X(15)  VALUE "Curso COBOL".

       PROCEDURE DIVISION.
           DISPLAY "Numerico: " WS-NUMERICO
           DISPLAY "Decimal: " WS-DECIMAL
           DISPLAY "Com sinal: " WS-NUMERICO-SINAL
           DISPLAY "Alfabetico: " WS-ALFABETICO
           DISPLAY "Alfanumerico: " WS-ALFANUMERICO
           STOP RUN.
